문제
행의 개수 N, 열의 개수 M이 주어질 때, 다음과 같이 출력하는 프로그램을 작성해보자. (단, 2차원 배열을 활용할 것)  

입력
첫째 줄에 자연수 N,M이 주어진다.(1<=N,M<=100)

 

출력
출력 예시와 같은 형식으로 출력한다.

 

예제 입력
3 4
예제 출력
1 2 3 4
5 6 7 8
9 10 11 12
 

예제 입력
4 3
예제 출력
1 2 3
4 5 6
7 8 9
10 11 12
 

예제 입력
5 5
예제 출력
1 2 3 4 5
6 7 8 9 10
11 12 13 14 15
16 17 18 19 20
21 22 23 24 25

#include <stdio.h>


int main() {
	int N, M;
	int i, j;
	int num = 1;
	scanf("%d %d", &N, &M);
	for (i = 0;i < N;i++) {
		for (j = 0;j < M;j++) {
			printf("%d ", num++);
		}
		printf("\n");
	}


	return 0;
}

